rsa加密介绍.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-23 Sat 18:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RSA总结</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
<link rel="stylesheet" type="text/css" href="./css/gitalk.css"/></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">RSA总结</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3c962a3">1. rsa算法原理</a>
<ul>
<li><a href="#org226be36">1.1. 公式推导</a></li>
</ul>
</li>
<li><a href="#orga1b2a2c">2. ASN1格式</a>
<ul>
<li><a href="#orga72f77e">2.1. 私有类型</a></li>
<li><a href="#org92ae1e2">2.2. 组合类型</a></li>
</ul>
</li>
<li><a href="#orge89de48">3. PKCS#1 格式</a></li>
<li><a href="#org7d1c42d">4. PKCS#8</a></li>
<li><a href="#orgf93f6d1">5. go 中的rsa包</a>
<ul>
<li><a href="#orge97b667">5.1. 获取公钥或私钥</a></li>
<li><a href="#org881ba35">5.2. 签名与验签</a></li>
</ul>
</li>
<li><a href="#orgf2d5b48">6. 资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3c962a3" class="outline-2">
<h2 id="org3c962a3"><span class="section-number-2">1</span> rsa算法原理</h2>
<div class="outline-text-2" id="text-1">
<p>
rsa是非对称加密,分为私钥与公钥,公钥主要保持了两个数字n, e. 私钥也主要保持两个数字n, d.对于任一一个数字a满足(a<sup>ed</sup>) mod n = a, 其中 ed mod (p-1)(q-1) = 1, n = pq. 这就保证了一个数字经过公钥加密后能被私钥解密.
</p>

<div class="org-src-container">
<pre class="src src-math">加密算法: c = a^e mod n
解密算法: a = c^d mod n
</pre>
</div>

<p>
公钥跟私钥在原则上并没有什么不同，(只不过d一般是个很大的数, e一般相对较小)。所以私钥，公钥都可以加密，都可以解密.(私钥加密又叫做签名)
</p>

<p>
但是如果对于一个很小的数字a, 由于n很大，所以有可能出现a<sup>e</sup> &lt; n 这时候就会出现 a<sup>e</sup> mod n = a<sup>e</sup>, 也就是说加密前后的数字是一样的，并没有起到加密的作用. 所以代码会填充随机字符,把数字的数量级提升到跟N一样。
</p>
</div>

<div id="outline-container-org226be36" class="outline-3">
<h3 id="org226be36"><span class="section-number-3">1.1</span> 公式推导</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-math">我们主要推导以下公式成立:
(a^ed) mod n = a

这里用到欧拉定理:
a^(f(n)) mod n = 1, f(n) 是一个函数，在这里只用到了其中一种特殊情况，
当p,q互质的时候,f(pq) = (p-1)(q-1)

由于: ed mod (p-1)(q-1) = 1
所以: ed = h(p-1)(q-1) + 1
所以我们要证明: a^(h(p-1)(q-1)+1) mod n = a
=&gt; a*a^(h*(p-1)*(q-1)) mod n = a


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga1b2a2c" class="outline-2">
<h2 id="orga1b2a2c"><span class="section-number-2">2</span> ASN1格式</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga72f77e" class="outline-3">
<h3 id="orga72f77e"><span class="section-number-3">2.1</span> 私有类型</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>BOOLEAN</li>
<li>INTEGER</li>
<li>REAL</li>
<li>NULL</li>
<li>BIT STRING</li>
<li>OCTET STRING</li>
<li>Character Strings</li>
<li>OBJECT IDENTIFIER</li>
<li>Object Descriptor</li>
<li>TIME TYPES</li>
</ol>
</div>
</div>
<div id="outline-container-org92ae1e2" class="outline-3">
<h3 id="org92ae1e2"><span class="section-number-3">2.2</span> 组合类型</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>SEQUENCE</li>
<li>SET</li>
<li>CHOICE</li>
<li>SET OF AND SEQUENCE OF</li>
<li>ANY</li>
<li>ANY DEFINED BY</li>
<li>EXTERNAL</li>
<li>EMBEDDED PDV</li>
<li>CHARACTER STRING</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orge89de48" class="outline-2">
<h2 id="orge89de48"><span class="section-number-2">3</span> PKCS#1 格式</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-golang">//公钥
type public struct {
  n INTEGER // n
  e INTEGER // e
}

//私钥
type private struct {
  version Version
  n INTEGER
  e INTEGER
  d INTEGER
  p INTEGER
  q INTEGER
  e1 INTEGER
  e2 INTEGER
  c INTEGER
  other OtherInfo //可选
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org7d1c42d" class="outline-2">
<h2 id="org7d1c42d"><span class="section-number-2">4</span> PKCS#8</h2>
<div class="outline-text-2" id="text-4">
<p>
由于PKCS#1不够通用，所以提出#8
</p>
<div class="org-src-container">
<pre class="src src-golang">type AlgorithmIdentifier struct {
  algorithm OID // 用的哪种算法
  parameters //可选信息
}
//公钥
type public struct {
  algorithm AlgorithmIdentifier
  publicKey []byte // 具体公钥信息 
}


// 私钥
type private struct {
  version Version
  algorithm AlgorithmIdentifier
  privateKey []byte //具体私钥信息, rsa 的话就是上面的PKCS#1私钥的结构
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf93f6d1" class="outline-2">
<h2 id="orgf93f6d1"><span class="section-number-2">5</span> go 中的rsa包</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orge97b667" class="outline-3">
<h3 id="orge97b667"><span class="section-number-3">5.1</span> 获取公钥或私钥</h3>
<div class="outline-text-3" id="text-5-1">
<p>
要使用rsa包，首先要得到公钥或者私钥,对于不同的格式有不同的方法调用。
</p>
<ol class="org-ol">
<li>PKCS#1格式</li>
</ol>
<div class="org-src-container">
<pre class="src src-golang">//公钥:
//不知道为何公钥的PKCS#1格式golang没有提供专门的接口进行解析,或许这种格式已经很少人用了？（不过我恰好遇到过）
//由签名的格式我们知道PKCS#1其实就是golang中rsa.PublicKey结构的ASN1编码，所以我们可以使用asn1包接口进行解析
  k := new(rsa.PublicKey)
	_, err = asn1.Unmarshal(der, k)

//私钥:
  x509.ParsePKCS1PrivateKey(der []byte)
//der为私钥文件进行base64解码获得
</pre>
</div>

<ol class="org-ol">
<li>PKCS#8格式</li>
</ol>
<div class="org-src-container">
<pre class="src src-golang">//公钥:
	x509.ParsePKIXPublicKey(derBytes []byte)
//这里derBytes一般由公钥文件进行base64解码获得

//私钥:
  x509.ParsePKCS8PrivateKey(der []byte)
//der为私钥文件进行base64解码获得

</pre>
</div>
</div>
</div>

<div id="outline-container-org881ba35" class="outline-3">
<h3 id="org881ba35"><span class="section-number-3">5.2</span> 签名与验签</h3>
<div class="outline-text-3" id="text-5-2">
<p>
对于rsa，我们最常做的操作就是签名与验签。
</p>
<ol class="org-ol">
<li>签名</li>
</ol>
<p>
一般来说签名之前我们需要对数据进行hash得到签名串，再对签名串进行加密.hash算法可以是md5,sha1等。这里我们使用md5
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #ffcb6b;">d</span> := <span style="color: #c3e88d;">"this is test"</span> 
<span style="color: #ffcb6b;">m</span> := md5.<span style="color: #82aaff;">New</span>()
m.<span style="color: #82aaff;">Write</span>([]<span style="color: #82aaff;">byte</span>(d))
<span style="color: #ffcb6b;">h</span> := m.<span style="color: #82aaff;">Sum</span>(<span style="color: #f78c6c;">nil</span>)
<span style="color: #89DDFF;">var</span> <span style="color: #ffcb6b;">b</span> *<span style="color: #c792ea;">rsa.PrivateKey</span> <span style="color: #676E95;">//</span><span style="color: #676E95;">&#36825;&#37324;&#20351;&#29992;&#31614;&#21517;&#30340;&#26041;&#27861;&#33719;&#21462;</span>
<span style="color: #ffcb6b;">sign</span>, <span style="color: #ffcb6b;">err</span> := b.<span style="color: #82aaff;">Sign</span>(rand.rander, h, crypto.MD5)
</pre>
</div>

<ol class="org-ol">
<li>验证签名</li>
</ol>
<div class="org-src-container">
<pre class="src src-golang">sign := "xxxx" //这是我们的签名
hash := "xxx" // 对数据进行的hash
var pk *rsa.PublicKey //公钥
err := rsa.VerifyPKCS1v15(pk, crypto.MD5, hash, sign)
if err == nil {
  //sucess
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf2d5b48" class="outline-2">
<h2 id="orgf2d5b48"><span class="section-number-2">6</span> 资料</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li><a href="https://www.itu.int/ITU-T/studygroups/com17/languages/X.690-0207.pdf">ASN1编码规则</a></li>
<li><a href="https://tls.mbed.org/kb/cryptography/asn1-key-structures-in-der-and-pem">rsa密钥文件格式</a></li>
<li><a href="http://www.ruanyifeng.com/blog/2013/06/rsa_algorithm_part_one.html">阮一峰{RSA算法原理-}</a></li>
<li><a href="http://www.ruanyifeng.com/blog/2013/07/rsa_algorithm_part_two.html">阮一峰{RSA算法原理二}</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="gitalk" /> <script> var gitalk = new Gitalk({
  clientID: 'f30e66bb5ab9089aa742',
  clientSecret: '5d256d445447bd4db16540c2aab0e0884218ed12',
  repo: 'guidao.github.io',
  owner: 'guidao',
  admin: ['guidao'],
  id: location.pathname,      // Ensure uniqueness and length less than 50
  distractionFreeMode: false  // Facebook-like distraction free mode
})
gitalk.render('gitalk') </script>
</div>
</body>
</html>
